IT_form_management/app/Models/FirewallRequestModel.php

SELECT *
FROM `requestlog` `T1`
LEFT JOIN `firewallrequestmaster` `T2` ON `T2`.`userid` = `T1`.`loged_usr`
LEFT JOIN `internetrequestmaster` `T3` ON `T3`.`user_id` = `T1`.`loged_usr`
WHERE `T1`.`loged_usr` = '9'
GROUP BY `T1`.`reqlog_id`, `T1`.`req_type`
---
    public function getPendingrequestfordashbord($uId)
    {

        $userId = 2;
        return $this->db->table('requestlog T1')
        ->join('firewallrequestmaster T2', 'T2.userid = T1.loged_usr', 'left')
        ->join('internetrequestmaster T3', 'T3.user_id = T1.loged_usr', 'left')
        ->where('T1.loged_usr', $uId)
        ->groupBy('T1.reqlog_id, T1.req_type')
        ->get()
        ->getResultArray();