IT_form_management/app/Models/RolepermissionsModel.php

SELECT `featurename`, `is_access`
FROM `rolepermissionmng`
JOIN `permissionmaster` ON `permissionmaster`.`id` = `rolepermissionmng`.`per_id`
WHERE `rolepermissionmng`.`role_id` = '3'
---
    public function getPermissions($roleid)
    {
        $permissions =  $this->select(['featurename', 'is_access'])->join('permissionmaster', 'permissionmaster.id = rolepermissionmng.per_id')
        ->where('rolepermissionmng.role_id', $roleid)->get()->getResultArray();